{
    "dad": [
        "What do you call a factory that makes okay products? A satisfactory.",
        "Dear Math, grow up and solve your own problems.",
        "What did the janitor say when he jumped out of the closet? Supplies!",
        "Have you heard about the chocolate record player? It sounds pretty sweet.",
        "What did the ocean say to the beach? Nothing, it just waved.",
        "Why do seagulls fly over the ocean? Because if they flew over the bay, we'd call them bagels.",
        "I only know 25 letters of the alphabet. I don't know y.",
        "How does the moon cut his hair? Eclipse it.",
        "What did one wall say to the other? I'll meet you at the corner.",
        "What did the zero say to the eight? That belt looks good on you.",
        "A skeleton walks into a bar and says, 'Hey, bartender. I'll have one beer and a mop.'",
        "Where do fruits go on vacation? Pear-is!",
        "I asked my dog what's two minus two. He said nothing.",
        "What did Baby Corn say to Mama Corn? Where's Pop Corn?",
        "What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
        "What does a sprinter eat before a race? Nothing, they fast!",
        "Where do you learn to make a banana split? Sundae school.",
        "What has more letters than the alphabet? The post office!",
        "Dad, did you get a haircut? No, I got them all cut!",
        "What do you call a poor Santa Claus? St. Nickel-less.",
        "I got carded at a liquor store, and my Blockbuster card accidentally fell out. The cashier said never mind.",
        "Where do boats go when they're sick? To the boat doc.",
        "I don't trust those trees. They seem kind of shady.",
        "My wife is really mad at the fact that I have no sense of direction. So I packed up my stuff and right!",
        "How do you get a squirrel to like you? Act like a nut.",
        "Why don't eggs tell jokes? They'd crack each other up.",
        "I don't trust stairs. They're always up to something.",
        "What do you call someone with no body and no nose? Nobody knows.",
        "Did you hear the rumor about butter? Well, I'm not going to spread it!",
        "Why couldn't the bicycle stand up by itself? It was two tired.",
        "What did one hat say to the other? Stay here! I'm going on ahead.",
        "Why did Billy get fired from the banana factory? He kept throwing away the bent ones.",
        "Dad, can you put my shoes on? No, I don't think they'll fit me.",
        "Why can't a nose be 12 inches long? Because then it would be a foot.",
        "What does a lemon say when it answers the phone? Yellow!",
        "This graveyard looks overcrowded. People must be dying to get in.",
        "What kind of car does an egg drive? A yolkswagen.",
        "Dad, can you put the cat out? I didn't know it was on fire.",
        "How do you make 7 even? Take away the s.",
        "How does a taco say grace? Lettuce pray.",
        "What time did the man go to the dentist? Tooth hurt-y.",
        "Why didn't the skeleton climb the mountain? It didn't have the guts.",
        "What do you call it when a snowman throws a tantrum? A meltdown.",
        "How many tickles does it take to make an octopus laugh? Ten tickles.",
        "I have a joke about chemistry, but I don't think it will get a reaction.",
        "What concert costs just 45 cents? 50 Cent featuring Nickelback!",
        "What does a bee use to brush its hair? A honeycomb!",
        "How do you make a tissue dance? You put a little boogie in it.",
        "Why did the math book look so sad? Because of all of its problems!",
        "What do you call cheese that isn't yours? Nacho cheese.",
        "My dad told me a joke about boxing. I guess I missed the punch line.",
        "What kind of shoes do ninjas wear? Sneakers!",
        "How does a penguin build its house? Igloos it together.",
        "How did Harry Potter get down the hill? Walking. JK! Rowling.",
        "I used to be addicted to soap, but I'm clean now.",
        "A guy walks into a bar...and he was disqualified from the limbo contest.",
        "You think swimming with sharks is expensive? Swimming with sharks cost me an arm and a leg.",
        "When two vegans get in an argument, is it still called a beef?",
        "I ordered a chicken and an egg from Amazon. I'll let you know...",
        "Do you wanna box for your leftovers? No, but I'll wrestle you for them.",
        "That car looks nice but the muffler seems exhausted.",
        "Shout out to my fingers. I can count on all of them.",
        "If a child refuses to nap, are they guilty of resisting a rest?",
        "What country's capital is growing the fastest? Ireland. Every day it's Dublin.",
        "I once had a dream I was floating in an ocean of orange soda. It was more of a fanta sea.",
        "Did you know corduroy pillows are in style? They're making headlines.",
        "Did you hear about the kidnapping at school? It's okay, he woke up.",
        "A cheeseburger walks into a bar. The bartender says, 'Sorry, we don't serve food here.'",
        "I once got fired from a canned juice company. Apparently I couldn't concentrate.",
        "I used to play piano by ear. Now I use my hands.",
        "Have you ever tried to catch a fog? I tried yesterday but I mist.",
        "I'm on a seafood diet. I see food and I eat it.",
        "Why did the scarecrow win an award? Because he was outstanding in his field.",
        "I made a pencil with two erasers. It was pointless.",
        "How do you make a Kleenex dance? Put a little boogie in it!",
        "I'm reading a book about anti-gravity. It's impossible to put down!",
        "Did you hear about the guy who invented the knock-knock joke? He won the 'no-bell' prize.",
        "I've got a great joke about construction, but I'm still working on it.",
        "I used to hate facial hair...but then it grew on me.",
        "I decided to sell my vacuum cleaner—it was just gathering dust!",
        "I had a neck brace fitted years ago and I've never looked back since.",
        "You know, people say they pick their nose, but I feel like I was just born with mine.",
        "What's brown and sticky? A stick.",
        "Why can't you hear a psychiatrist using the bathroom? Because the 'P' is silent.",
        "What do you call an elephant that doesn't matter? An irrelephant.",
        "What do you get from a pampered cow? Spoiled milk.",
        "I like telling Dad jokes. Sometimes he laughs!",
        "What's the best smelling insect? A deodor-ant.",
        "I used to be a personal trainer. Then I gave my too weak notice.",
        "Did I tell you the time I fell in love during a backflip? I was heels over head!",
        "If a child refuses to sleep during nap time, are they guilty of resisting a rest?",
        "I ordered a chicken and an egg online. I’ll let you know.",
        "It takes guts to be an organ donor.",
        "If you see a crime at an Apple Store, does that make you an iWitness?",
        "I'm so good at sleeping, I can do it with my eyes closed!",
        "I was going to tell a time-traveling joke, but you guys didn't like it.",
        "What do you call a fake noodle? An impasta.",
        "What do you call a belt made of watches? A waist of time.",
        "What happens when a strawberry gets run over crossing the street? Traffic jam.",
        "What do you call two monkeys that share an Amazon account? Prime mates.",
        "What do you call a pony with a sore throat? A little hoarse.",
        "Where do math teachers go on vacation? Times Square.",
        "Whenever I try to eat healthy, a chocolate bar looks at me and Snickers.",
        "What does garlic do when it gets hot? It takes its cloves off.",
        "What's a robot's favorite snack? Computer chips.",
        "How much does it cost Santa to park his sleigh? Nothing, it's on the house.",
        "Mountains aren't just funny. They're hill areas.",
        "What do clouds wear? Thunderwear.",
        "Why are piggy banks so wise? They're filled with common cents.",
        "Why is Peter Pan always flying? He neverlands.",
        "How do you get a good price on a sled? You have toboggan.",
        "How can you tell if a tree is a dogwood tree? By its bark.",
        "I used to hate facial hair, but then it grew on me.",
        "It's inappropriate to make a 'dad joke' if you're not a dad. It's a faux pa.",
        "What do you call a hot dog on wheels? Fast food!",
        "Where do young trees go to learn? Elementree school.",
        "Did you hear about the circus fire? It was in tents.",
        "Can February March? No, but April May!",
        "How do lawyers say goodbye? We'll be suing ya!",
        "Wanna hear a joke about paper? Never mind—it's tearable.",
        "What's the best way to watch a fly fishing tournament? Live stream.",
        "Spring is here! I got so excited I wet my plants.",
        "I could tell a joke about pizza, but it's a little cheesy.",
        "Don't trust atoms. They make up everything!",
        "When does a joke become a dad joke? When it becomes apparent.",
        "I wouldn't buy anything with velcro. It's a total rip-off.",
        "What’s an astronaut’s favorite part of a computer? The space bar.",
        "I don't play soccer because I enjoy the sport. I'm just doing it for kicks!",
        "Why are elevator jokes so classic and good? They work on many levels.",
        "Why do bees have sticky hair? Because they use a honeycomb.",
        "What do you call a fake noodle? An impasta.",
        "Which state has the most streets? Rhode Island.",
        "What did the coffee report to the police? A mugging.",
        "What did the fish say when he hit the wall? Dam.",
        "Is this pool safe for diving? It deep ends.",
        "If you see a crime happen at the Apple store, what does it make you? An iWitness."
    ],
    "chuck": [
        "Chuck Norris doesn’t read books. He stares them down until he gets the information he wants.",
        "Time waits for no man. Unless that man is Chuck Norris.",
        "If you spell Chuck Norris in Scrabble, you win. Forever.",
        "Chuck Norris breathes air … five times a day.",
        "In the Beginning there was nothing … then Chuck Norris roundhouse kicked nothing and told it to get a job.",
        "When God said, “Let there be light!” Chuck said, “Say Please.”",
        "Chuck Norris has a mug of nails instead of coffee in the morning.",
        "If Chuck Norris were to travel to an alternate dimension in which there was another Chuck Norris and they both fought, they would both win.",
        "The dinosaurs looked at Chuck Norris the wrong way once. You know what happened to them.",
        "Chuck Norris’ tears cure cancer. Too bad he has never cried.",
        "Chuck Norris once roundhouse kicked someone so hard that his foot broke the speed of light",
        "If you ask Chuck Norris what time it is, he always says, ‘Two seconds till.’ After you ask, ‘Two seconds to what?’ he roundhouse kicks you in the face.",
        "Chuck Norris appeared in the ‘Street Fighter II’ video game, but was removed by Beta Testers because every button caused him to do a roundhouse kick. When asked bout this “glitch,” Chuck Norris replied, “That’s no glitch.”",
        "Since 1940, the year Chuck Norris was born, roundhouse kick related deaths have increased 13,000 percent.",
        "Chuck Norris does not own a stove, oven, or microwave , because revenge is a dish best served cold.",
        "Chuck Norris does not sleep. He waits.",
        "There is no chin behind Chuck Norris’ beard. There is only another fist.",
        "The chief export of Chuck Norris is pain.",
        "Chuck Norris recently had the idea to sell his pee as a canned beverage. It’s now called Red Bull.",
        "If paper beats rock, rock beats scissors, and scissors beats paper, what beats all 3 at the same time? Chuck Norris.",
        "On the 7th day, God rested … Chuck Norris took over.",
        "Chuck Norris can dribble a bowling ball.",
        "Chuck Norris drinks napalm to fight his heartburn.",
        "Chuck Norris’ roundhouse kick is so powerful, it can be seen from outer space by the naked eye.",
        "If you want a list of Chuck Norris’ enemies, just check the extinct species list.",
        "Chuck Norris has never blinked in his entire life. Never.",
        "Chuck Norris once shot an enemy plane down with his finger, by yelling, “Bang!”",
        "Chuck Norris does not use spell check. If he happens to misspell a word, Oxford will change the spelling.",
        "Some kids pee their name in the snow. Chuck Norris can pee his name into concrete.",
        "Chuck Norris’ calendar goes straight from March 31st to April 2nd, because no one fools Chuck Norris.",
        "Chuck Norris counted to infinity… twice.",
        "Chuck Norris can speak Braille.",
        "Chuck Norris can have both feet on the ground and kick butt at the same time.",
        "Chuck Norris can do a wheelie on a unicycle.",
        "Chuck Norris stands faster than anyone can run.",
        "Once a cobra bit Chuck Norris’ leg. After five days of excruciating pain, the cobra died.",
        "Chuck Norris once won a game of Connect Four in three moves.",
        "Champions are the breakfast of Chuck Norris.",
        "When the Boogeyman goes to sleep every night he checks his closet for Chuck Norris.",
        "Chuck Norris can slam revolving doors.",
        "Chuck Norris does not hunt because the word hunting implies the possibility of failure. Chuck Norris goes killing.",
        "The dark is afraid of Chuck Norris.",
        "Chuck Norris can kill two stones with one bird.",
        "Chuck Norris can play the violin with a piano.",
        "Chuck Norris makes onions cry.",
        "Death once had a near-Chuck-Norris experience.",
        "When Chuck Norris writes, he makes paper bleed.",
        "Chuck Norris can strangle you with a cordless phone.",
        "Chuck Norris never retreats; He just attacks in the opposite direction.",
        "Chuck Norris can build a snowman out of rain.",
        "Chuck Norris once punched a man in the soul.",
        "Chuck Norris can drown a fish.",
        "Chuck Norris once had a heart attack. His heart lost.",
        "When Chuck Norris looks in a mirror, the mirror shatters. Because not even glass is dumb enough to get in between Chuck Norris and Chuck Norris.",
        "When Chuck Norris enters a room, he doesn’t turn the lights on, he turns the dark off.",
        "The only time Chuck Norris was ever wrong was when he thought he had made a mistake.",
        "Chuck Norris can tie his shoes with his feet.",
        "The quickest way to a man’s heart is with Chuck Norris’s fist.",
        "Chuck Norris is the only person that can punch a cyclops between the eye.",
        "Chuck Norris used to beat up his shadow because it was following to close. It now stands 15 feet behind him.",
        "There has never been a hurricane named Chuck because it would have destroyed everything.",
        "Outer space exists because it’s afraid to be on the same planet with Chuck Norris.",
        "When Chuck Norris does a pushup, he’s pushing the Earth down.",
        "Chuck Norris is the reason why Waldo is hiding.",
        "Chuck Norris doesn’t wear a watch. He decides what time it is.",
        "Chuck Norris does not get frostbite. Chuck Norris bites frost.",
        "In Pamplona, Spain, the people may be running from the bulls, but the bulls are running from Chuck Norris.",
        "Chuck Norris spices up his steaks with pepper spray.",
        "The Great Wall of China was originally created to keep Chuck Norris out. It didn’t work.",
        "Chuck Norris can get in a bucket and lift it up with himself in it.",
        "Most people have 23 pairs of chromosomes. Chuck Norris has 72… and they’re all lethal.",
        "Chuck Norris is the only man to ever defeat a brick wall in a game of tennis.",
        "Chuck Norris doesn’t shower, he only takes blood baths.",
        "Chuck Norris can divide by zero.",
        "The show Survivor had the original premise of putting people on an island with Chuck Norris. There were no survivors.",
        "Chuck Norris destroyed the periodic table, because Chuck Norris only recognizes the element of surprise.",
        "Chuck Norris once kicked a horse in the chin. Its descendants are now known as giraffes.",
        "When Chuck Norris was born, the only person who cried was the doctor. Never slap Chuck Norris.",
        "When Chuck Norris does division, there are no remainders.",
        "It takes Chuck Norris 20 minutes to watch 60 Minutes.",
        "Chuck Norris proved that we are alone in the universe. We weren’t before his first space expedition.",
        "Chuck Norris once went skydiving, but promised never to do it again. One Grand Canyon is enough.",
        "Chuck Norris once ordered a steak in a restaurant. The steak did what it was told.",
        "We live in an expanding universe. All of it is trying to get away from Chuck Norris.",
        "Chuck Norris had to stop washing his clothes in the ocean. Too many tsunamis.",
        "Chuck Norris can sneeze with his eyes open.",
        "Chuck Norris can cook minute rice in 30 seconds.",
        "Chuck Norris beat the sun in a staring contest.",
        "Superman owns a pair of Chuck Norris undies.",
        "Chuck Norris doesn’t breathe, he holds air hostage.",
        "Chuck Norris can clap with one hand.",
        "Chuck Norris doesn’t need to shave. His beard is scared to grow.",
        "Before he forgot a gift for Chuck Norris, Santa Claus was real.",
        "In an average living room there are a thousand objects Chuck Norris could use to kill you, including the room itself.",
        "Chuck Norris invented airplanes because he was tired of being the only person that could fly.",
        "Chuck Norris’s belly button is actually a power outlet.",
        "Freddy Krueger has nightmares about Chuck Norris.",
        "Chuck Norris is the only man who can fight himself and win.",
        "Chuck Norris’ cowboy boots are made from real cowboys.",
        "Chuck Norris can start a fire with an ice cube.",
        "The flu gets a Chuck Norris shot every year."
    ],
    "bad": [
        "Why don’t oysters donate to charity? Because they’re shellfish.",
        "What does a baby computer call its father? Data.",
        "What did the custodian say when he jumped out of the closet? “Supplies!”",
        "Why are colds bad criminals? Because they’re easy to catch.",
        "How does a penguin build its house? Igloos it together.",
        "Which knight invented King Arthur’s Round Table? Sir Cumference.",
        "What do sprinters eat before a race? Nothing. They fast.",
        "What do you call a fly without wings? A walk!",
        "What happens when you witness a ship wreck? You let it sink in.",
        "How can you find Will Smith in the snow? Follow the fresh prints.",
        "What does a clock do when it’s hungry? It goes back four seconds.",
        "What’s the easiest way to make a glow worm happy? Cut off its tail—it’ll be delighted!",
        "What do you call a belt made of watches? A waist of time!",
        "Why did Adele cross the road? To say hello from the other side!",
        "What’s the best way to carve wood? Whittle by whittle.",
        "What did the teacher do with the student’s report on cheese? She grated it.",
        "What’s the difference between a piano and a fish? You can tune a piano, but you can’t tuna fish.",
        "What did the pirate say on his 80th birthday? “Aye, matey!”",
        "How do you organize an astronomer’s party? You planet.",
        "What’s the action like at a circus? In-tents.",
        "Why did the scarecrow get promoted? Because he was outstanding in his field.",
        "Why does Snoop Dogg carry an umbrella? Fo’ drizzle.",
        "What do you call a pony with a sore throat? A little hoarse.",
        "What do you call a fish with no eye? Fsh.",
        "What do you call a boomerang that doesn’t come back? A stick!",
        "What kind of car does an egg drive? A Yolkswagen.",
        "What do you call a factory that sells generally decent goods? A satisfactory.",
        "Why was 6 afraid of 7? Because 7 ate 9.",
        "Why should you never eat a clock? Because it’s too time consuming.",
        "What should a sick bird do? Get tweetment.",
        "I want a job cleaning mirrors. It’s something I can really see myself doing.",
        "What grades did the pirate get on his report card? Seven Cs.",
        "How do you make a tissue dance? Put a little boogie in it.",
        "How did Ebenezer Scrooge win the football game? The ghost of Christmas passed!",
        "Did you hear about the mediocre restaurant on the moon? It has great food but no atmosphere.",
        "What kinds of pictures do hermit crabs take? Shellfies.",
        "What do you get a man with the heart of a lion? A lifetime ban from the zoo.",
        "What do you call a person with a briefcase in a tree? A branch manager.",
        "Why did the baby cookie cry? Because its mother was a wafer so long.",
        "What’s the difference between an alligator and a crocodile? One you’ll see later, the other you’ll see in a while.",
        "When is a door not really a door? When it’s really ajar.",
        "What do you do when you see a spaceman? Park in it, man.",
        "Why do you never see elephants hiding in trees? Because they’re so good at it!",
        "Did you hear about the claustrophobic astronaut? Poor guy really needed some space.",
        "What’s the No. 1 cause of divorce? Marriage!",
        "Why did the coffee call the police? It got mugged!",
        "Why did Cyclops close his school? He only had one pupil.",
        "Where do skunks pray? In pews.",
        "If you’re American when you come out of the bathroom, what are you when you’re in the bathroom? European.",
        "Why do birds fly south for the winter? Because it’s too far to walk.",
        "How did Darth Vader know what Luke Skywalker got him for Christmas? He felt his presents.",
        "What was the mummy’s favorite type of music? Wrap.",
        "I’m only familiar with 25 letters of the alphabet. I don’t know why.",
        "Did you hear about the beautiful wedding? Even the cake was in tiers.",
        "Why are there fences are cemeteries? Because everyone’s always dying to get in.",
        "A company is making glass coffins. Whether they’re successful remains to be seen.",
        "What did one wall say to the other? “Meet me at the corner!”",
        "What do you call a large African mammal with long hair and sandals? A hippie-potamus.",
        "How do you think the unthinkable? With an itheberg!",
        "What’s the award for being the best dentist? A plaque.",
        "Why can’t you hear a pterodactyl go to the bathroom? Because the P is silent.",
        "I bought sneakers from a drug dealer. I don’t know what he laced them with but I’ve been tripping all day!",
        "Why did Mozart hate chickens? Because when he asked them for their favorite composer, they said, “Bach! Bach! Bach!”",
        "Why did the toilet paper roll downhill? To get to the bottom.",
        "What’s the best name for a man who can’t stand? Neil.",
        "What do you call a deer with no eyes? No eyed deer.",
        "Why are groups of fish so smart? Because they travel in schools.",
        "How much does the heaviest skeleton weigh? A skeleton.",
        "What did the drummer name her twin daughters? Anna One, Anna Two.",
        "What’s big, gray and doesn’t matter? An irrelephant.",
        "Why did the snowman pick through a bag of carrots? Because he was picking his nose.",
        "Why does Waldo only wear stripes? Because he doesn’t want to be spotted.",
        "I witnessed an attempted murder earlier—fortunately only one crow showed up!",
        "I tried buying camouflage the other day but I couldn’t find any.",
        "What did one bean say to the other? “How you bean?”",
        "How do you catch a bra? With a booby trap.",
        "How many tickles can an octopus take? Tentacles!",
        "What do clouds wear under their shorts? Thunderpants.",
        "Did you hear about the guy who won the award for best knock knock joke? He won the no bell prize.",
        "Why did Cinderella get kicked off of the soccer team? Because she kept running from the ball!",
        "How many ears do space aliens have? Three: The left ear, right ear and the final front ear.",
        "Cosmetic surgery used to be taboo, but now when you talk about Botox no one raises an eyebrow.",
        "Did you hear the one about the three watering holes in the ground? Well, well, well…",
        "What did the socks say to the pants? “‘Sup britches?!”",
        "What shivers at the bottom of the ocean? A nervous wreck.",
        "What’s a ninja’s favorite type of shoes? Sneakers!",
        "I have the world’s worst thesaurus. Not only is it terrible, it’s also terrible.",
        "What do hillbillies drink from? Hiccups.",
        "What’s even better than Ted Danson? Ted singing and Danson.",
        "Why did the invisible man turn down a job offer? He couldn’t see himself doing it.",
        "What kind of music do windmills like? They’re metal fans.",
        "What do you call a fish with two knees? A tunee fish.",
        "I’d tell you the joke about perforated paper, but it’s tear-able.",
        "What do you call someone else’s cheese? Nacho cheese!",
        "What do you call a canine magician? A labracadabrador.",
        "The rotation of the earth really makes my day.",
        "Why do seagulls fly over the sea? Because if they flew over the bay, they’d be called bagels.",
        "What did the animals tell Simba when he walked too slow? Mufasa!",
        "What do you call Samsung’s security team? The Guardians of the Galaxy!",
        "I sold my vacuum yesterday. It was just collecting dust.",
        "What kind of tea is hardest to swallow? Reality.",
        "Why did the golfer need new pants? Because he got a hole in one.",
        "Why did the man get fired from the calendar factory? Because he took a few days off.",
        "What do you call an alligator wearing a vest? An investigator.",
        "How do snails fight? They slug it out.",
        "What’s Forrest Gump‘s email password? 1forrest1.",
        "What did the left butt cheek say to the right butt cheek? “You crack me up!”",
        "What do you call someone who points out the obvious? Someone who points out the obvious.",
        "What sound does a nut make when it sneezes? Cashew!",
        "Did you hear about the satellites’ wedding? The ceremony was OK, but the reception was terrific.",
        "What did the Atlantic Ocean say to the Pacific Ocean? Nothing, it just waved.",
        "What did the fish say when it swam into the wall? “Dam!”",
        "Which school supply is king? The ruler.",
        "What do you get when you cross a vampire with a snowman? Frostbite.",
        "What do you call a person with no body and no nose? Nobody knows.",
        "What’s green and sings? Elvis Parsley.",
        "How do you make holy water? You boil the hell out of it.",
        "A jumper cable walks into a bar. The bartender says, “I’ll serve you, but don’t start anything.”",
        "What’s the worst part of being an egg? You only get laid once (and it’s with your mom)!",
        "Three fish are in a tank. One asked the others, “How the heck do you drive this thing?”"
    ]
}